# Install Virtualbox before the cask (or untap caskroom/versions
cask "virtualbox"

#
# Brew taps
#
#tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

#
# Browsers
#
cask 'firefox'
#cask "google-chrome"

#
# Terminal / Shell
#
cask "iterm2"
brew "zsh"
brew "bash"
brew "tmux"

#
# Commands
#
brew "netcat"
brew "wget"
brew "jq"
brew "ncdu"
brew "gnupg"

#
# Proxy
#
brew "cntlm", restart_service: true

#
# Editors
#
cask "visual-studio-code"
brew "vim"

#
# Version Control
#
brew "git"
#cask "sourcetree"
#cask "p4merge"

#
# Microsoft
#
cask "powershell"
brew "mono"

#
# Virtualisation
#
cask "vagrant"
#brew "packer"
#brew "qemu", args: ["with-sdl2"]
brew "cdrtools"

#
# Docker
#
cask "caskroom/versions/docker-edge"
brew "kubernetes-cli"

#
# Languages
#
#cask "caskroom/versions/java8"
brew "node"
#brew "go"

#
# Password Management
#
#brew "gopass"
#brew "vault"

#
# Apps
#
# Clipboard Manager
cask "copyclip"
# Remote Desktop
cask "cord"
# Backup
cask "dropbox"
cask "google-backup-and-sync"
# cask "duplicati"
# Keyboard
# cask "karabiner-elements"
cask "drawio"
brew "awscli"

#
# Other / Uncategorised / brew_save
#
brew "python"
brew "python2"
cask "firefox"
cask "xquartz"
tap "homebrew/cask"
tap "homebrew/cask-versions"
brew "dos2unix"
cask "keepassx"
cask "ticktick"
cask "spotify"

# Finder Quick Look preview extensions - https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "qlvideo"
